policy_topic = [
    "هل ينبغي في الصين المعاصرة أن يُعاقب تجار النساء والأطفال بنفس شدة عقاب المشترين لهم (مؤيد) / أم لا ينبغي (معارض)؟",
    "هل يسهم فرض ضريبة بيئية في الحد من التلوث (مؤيد) / أم أنه لن يحقق ذلك (معارض)؟",
    "هل ينبغي تقنين تأجير الأرحام لأغراض تجارية (مؤيد) / أم لا ينبغي (معارض)؟",
    "هل تسهم الكوتا الجندرية في مجالس الإدارة في تحقيق المساواة الجندرية في مكان العمل (مؤيد) / أم لا تسهم (معارض)؟",
    "هل ينبغي على الدول المتقدمة فرض ضريبة على الدهون (مؤيد) / أم لا ينبغي (معارض)؟",
    "هل ينبغي على الولايات المتحدة فرض حظر على الأسلحة المدنية (مؤيد) / أم لا ينبغي (معارض)؟",
    "هل يحمي قانون حقوق النشر في الاتحاد الأوروبي الإبداع الفني (مؤيد) / أم يحد منه (معارض)؟",
    "هل ينبغي إلغاء نظام البيع المسبق للعقارات (مؤيد) / أم لا ينبغي (معارض)؟",
    "هل يعتبر تطبيق القانون أكثر فعالية من الإجراءات التعليمية في معالجة العنف المدرسي (مؤيد) / أم لا (معارض)؟",
    "هل ينبغي تقنين القتل الرحيم (مؤيد) / أم لا ينبغي (معارض)؟",
    "هل ينبغي إلغاء عقوبة الإعدام (مؤيد) / أم لا ينبغي (معارض)؟",
    "هل تساهم عقوبات السجن الطويلة في ردع الجرائم (مؤيد) / أم أن العقوبات البديلة أكثر فاعلية (معارض)؟"
]

creative_topic = [
    "هل يُعتبر الفن المُنتج بواسطة الذكاء الاصطناعي فناً (مؤيد) / أم لا يعتبر (معارض)؟",
    "إذا فقد الشخص ذاكرته بالكامل، هل ينبغي أن يُحاسب على جرائمه السابقة (مؤيد) / أم لا ينبغي (معارض)؟",
    "في البحث عن الحقيقة، هل ينبغي منع العلماء من تقديم تضحيات شخصية لتحقيق الحقيقة (مؤيد) / أم لا ينبغي (معارض)؟",
    "هل يُعتبر الإساءة إلى الشخصيات الافتراضية في الألعاب أمرًا أخلاقيًا (مؤيد) / أم غير أخلاقي (معارض)؟",
    "إذا استطاع الذكاء الاصطناعي القيام بجميع الأعمال البشرية، هل سيكون ذلك مرغوبًا (مؤيد) / أم مؤسفًا (معارض)؟",
    "هل ينبغي على تانغ سانزانغ قبول التحدي الأخير (مؤيد) / أم لا ينبغي (معارض)؟",
    "هل من الأفضل أن ينتقل الرجل الحكيم من الجبال (مؤيد) / أم يبقى ويواجه التحديات (معارض)؟",
    "هل يُعتبر معرفة وقت الوفاة من الولادة أمرًا محظوظًا (مؤيد) / أم مؤسفًا (معارض)؟",
    "هل ساعدت الرحلة إلى الغرب الملك القرد في العثور على نفسه (مؤيد) / أم جعلته يفقد نفسه (معارض)؟",
    "إذا كانت الحياة رواية، هل الشخصيات أكثر أهمية (مؤيد) / أم الحبكة أكثر أهمية (معارض)؟"
]

fact_topic = [
    "هل يُعتبر نموذج الوكيل ضروريًا لتحقيق الذكاء الاصطناعي العام (مؤيد) / أم غير ضروري (معارض)؟",
    "هل وسائل التواصل الاجتماعي مناسبة (مؤيد) / أم غير مناسبة (معارض) لمناقشة المواضيع العميقة؟",
    "هل جعلت تقنية VAR كرة القدم أفضل (مؤيد) / أم لم تفعل (معارض)؟",
    "هل يعزز تجزئة المعلومات القدرات الإدراكية (مؤيد) / أم يضعفها (معارض)؟",
    "هل تفيد سياسة التركيز على المعدل التراكمي (GPA) نمو الطلاب (مؤيد) / أم تضرهم (معارض)؟",
    "هل ينبغي أن يكون التوقع الوظيفي هو الاعتبار الرئيسي في اختيار التخصص الجامعي (مؤيد) / أم لا ينبغي (معارض)؟",
    "هل تستفيد المدن أكثر من استضافة الأحداث الرياضية الكبيرة (مؤيد) / أم تتضرر أكثر (معارض)؟",
    "هل يزيد التقدم التكنولوجي من الأمان البشري (مؤيد) / أم يقلله (معارض)؟",
    "هل الفجوات المؤسسية هي السبب الرئيسي (مؤيد) / أم فجوات الإدارة (معارض) وراء مشاكل سلامة الغذاء؟",
    "هل تؤثر وسائل التواصل الاجتماعي بشكل إيجابي (مؤيد) / أم سلبي (معارض) على الرأي العام؟",
    "هل يفيد عدم الكشف عن الهوية عبر الإنترنت الحوار العام (مؤيد) / أم يضر به (معارض)؟",
    "هل يبعدنا عصر الإعلام الذاتي عن الحقيقة (مؤيد) / أم يقربنا منها (معارض)؟",
    "هل يعتبر انتشار الفيديوهات القصيرة علامة على فقر ثقافي (مؤيد) / أم إثراء (معارض)؟",
    "هل يعود تدفق البيانات الحرة عالميًا بالنفع (مؤيد) / أم الضرر (معارض)؟",
    "هل يحتاج المجتمع الحديث إلى الخبراء العامين أكثر (مؤيد) / أم إلى المتخصصين (معارض)؟"
]

value_topic = [
    "هل الطبيعة البشرية خيّرة بطبيعتها (مؤيد) / أم شريرة (معارض)؟",
    "هل المال هو أصل كل الشرور (مؤيد) / أم ليس كذلك (معارض)؟",
    "هل من الصواب الحكم على الأبطال بناءً على النجاح (مؤيد) / أم لا (معارض)؟",
    "هل يعتبر الجمال تجربة شخصية (مؤيد) / أم شيء موضوعي (معارض)؟",
    "هل العدالة تتعلق بالمصلحة فقط (مؤيد) / أم لا (معارض)؟",
    "هل يأتي النمو من الظروف الملائمة أكثر (مؤيد) / أم من التحديات (معارض)؟",
    "هل يجعل الحب الإنسان أكثر حرية (مؤيد) / أم أقل حرية (معارض)؟",
    "هل من الأسهل أن تعرف من أن تفعل (مؤيد) / أم أن تفعل من أن تعرف (معارض)؟",
    "في المجتمع الحديث، هل التفكير العاطفي أكثر أهمية من التفكير القانوني (مؤيد) / أم العكس (معارض)؟",
    "هل المثالية أكثر قيمة من الواقعية (مؤيد) / أم الواقعية أكثر قيمة (معارض)؟",
    "هل قيمة الجهد الشبابي تظهر في العملية (مؤيد) / أم في النتائج (معارض)؟",
    "هل العنف الانتقامي عادل (مؤيد) / أم غير عادل (معارض)؟",
    "هل الراحة الأساسية ضرورية لمناقشة الأخلاق (مؤيد) / أم ليست كذلك (معارض)؟",
    "هل القوانين السيئة غير صالحة (مؤيد) / أم يجب إطاعتها (معارض)؟",
    "في المواقف الخطيرة، هل يجب أن تفضل السيارات ذاتية القيادة سلامة الركاب (مؤيد) / أم سلامة المشاة (معارض)؟"
]

TOPICS = policy_topic + creative_topic + fact_topic + value_topic
CANDIDATE_MODEL_LIST = [
    # closed
    "google/gemini-pro-1.5",
    "google/gemini-flash-1.5",
    "anthropic/claude-3-haiku",
    "anthropic/claude-3.5-sonnet",
    "openai/gpt-4o-mini",
    "openai/gpt-4o",
    "glm-4-air",
    # open
    "deepseek-chat",
    "qwen/qwen-2-72b-instruct",
]
